# **#25 Pengaturan tampilan (display option) pada Python Pandas**

**Import Modules**

In [3]:
import pandas as pd

print(pd.__version__)

2.2.2

**Persiapan Data Frame**

In [ ]:
df = pd.read_csv('./data/titanicfull.csv')
df

**Pengaturan Tampilan**

In [ ]:
#Menetapkan opsi untuk menampilkan maksimum 5 baris.
pd.set_option('display.max_rows', 5)

#Menetapkan opsi untuk menampilkan maksimum 6 kolom.
pd.set_option('display.max_columns', 6)

#Menetapkan opsi untuk menampilkan maksimum 20 karakter lebar kolom.
pd.set_option('display.max_colwidth', 20)

df

In [ ]:
#Untuk emlakukan reset display kita bisa menggunakan fungsi pd.reset_option()

#Mengembalikan opsi display ke nilai default
pd.reset_option('^display.', silent=True)

df

In [ ]:
#Gunakan fungsi pd.describe_option() untuk melihat option yang di konfigurasi

#Menampilkan deskripsi semua opsi pandas
pd.describe_option()

# **#26 Membentuk Data Frame dari Hasil Seleksi Spreadsheet**

**Import Modules**

In [10]:
import pandas as pd

print(pd.__version__)

2.2.2

**Membuat data frame dari hasil seleksi Spreadsheet**

In [15]:
df = pd.read_clipboard()
df

,#,Membaca,data,dari,clipboard,dengan,delimiter,'\t',(tab)
0,delimiter,=,'\t',None,None,NaN,NaN,NaN,NaN
1,df,=,pd.read_clipboard(sep=delimiter),None,None,NaN,NaN,NaN,NaN
2,#,Menampilkan,DataFrame,hasil,pembacaan,NaN,NaN,NaN,NaN
3,df,None,None,None,None,NaN,NaN,NaN,NaN

# **#27 Mengenal fungsi agregasi first() dan last()**

**Import Modules**

In [19]:
import pandas as pd

print(pd.__version__)

2.2.2

**Persiapan Data Frame**

In [22]:
d = {'dokter':['Budi', 'Wati', 'Iwan', 'Budi', 'Budi', 'Wati'], 
     'pasien':['Abdul', 'Rahmat', 'Asep', 'Joko', 'Wiwin', 'Lisa']}

df = pd.DataFrame(d)
df

  dokter  pasien
0   Budi   Abdul
1   Wati  Rahmat
2   Iwan    Asep
3   Budi    Joko
4   Budi   Wiwin
5   Wati    Lisa

**Mengenal Fungsi Agregasi First() dan Last()**

- Pertama akan kita kelompokkan berdasarkan dokter (ada 3)
- Kemudian menghitung jumlah pasien untuk setiap dokter menggunakan fungsi agregasi count()
- Kemudian menampilkan pasien pertama untuk setiap dokter menggunakan fungsi agregasi first()
- Terakhir menampilkan pasien terakhir untuk setiap dokter menggunakan fungsi agregasi last()

In [25]:
#Menggunakan groupby untuk menghitung jumlah pasien setiap dokter
df.groupby('dokter')['pasien'].count().to_frame()

        pasien
dokter
Budi         3
Iwan         1
Wati         2

In [27]:
df.groupby('dokter')['pasien'].first().to_frame()

        pasien
dokter
Budi     Abdul
Iwan      Asep
Wati    Rahmat

In [29]:
df.groupby('dokter')['pasien'].last().to_frame()

       pasien
dokter
Budi    Wiwin
Iwan     Asep
Wati     Lisa

# **#28 Mengenal Explode dan Implode pada Data Frame**

**Import Modules**

In [33]:
import pandas as pd

print(pd.__version__)

2.2.2

**Persiapan Data Frame**

In [36]:
d = {'Team':['DC', 'Marvel'], 
     'Heroes':[['Batman', 'Superman', 'Wonder Woman', 'Aquaman', 'Green Lantern', 'Shazam'], 
               ['Iron Man', 'Captain America', 'Ant-Man', 'Black Panther', 'Captain Marvel']]}

df = pd.DataFrame(d)
df

     Team                                             Heroes
0      DC  [Batman, Superman, Wonder Woman, Aquaman, Gree...
1  Marvel  [Iron Man, Captain America, Ant-Man, Black Pan...

**Explode**

- Hasil explode ditampung kedalam variable baru
- Kolom heroes di explode sehingga memiliki baris terpisah

In [40]:
#Menggunakan explode untuk memisahkan nilai di kolom 'Heroes'
df1 = df.explode('Heroes')
df1

     Team           Heroes
0      DC           Batman
0      DC         Superman
0      DC     Wonder Woman
0      DC          Aquaman
0      DC    Green Lantern
0      DC           Shazam
1  Marvel         Iron Man
1  Marvel  Captain America
1  Marvel          Ant-Man
1  Marvel    Black Panther
1  Marvel   Captain Marvel

**Implode**

- Implode adalah kebalikan dari explode, yaitu menyatukan kembali menjadi suatu list
- Pertama kita buat dulu df2 dimana hanya berisi kolom Tim DC dan Tim Marvel
- Lalu pada bagian df1 kita kelompokkkan berdasarkan indexnya yaitu 0 dan 1
- Setelah itu kolom heroes kita agregasi menjadi suatu list
- Dan yang terakhir masukkan kedalam df 2.

In [43]:
#Membuat DataFrame baru dengan satu kolom 'Team'
d = {'Team': ['DC', 'Marvel']}
df2 = pd.DataFrame(d)
df2

     Team
0      DC
1  Marvel

In [45]:
#Menggabungkan DataFrame df1 dengan df2 berdasarkan indeks
df2['Imploded'] = df1.groupby(df1.index)['Heroes'].agg(list)
df2

     Team                                           Imploded
0      DC  [Batman, Superman, Wonder Woman, Aquaman, Gree...
1  Marvel  [Iron Man, Captain America, Ant-Man, Black Pan...